// Init Question

export  const quiz = {
    questions: [
        {
            text: "Что случилось с Энакином Скайуокером во время битвы с графом Дуку?",
            answers: [
                {text: "Он потерял левую ногу"},
                {text: "Он потерял правую руку", correct: true},
                {text: "Он потерял правую ногу"},
                {text: "Он потерял"},
            ],
        },
        {
            text: "Кто играл роль командира Коди?",
            answers: [
                {text: "Джей Лагайя"},
                {text: "Темуэра Моррисон", correct: true},
                {text: "Ахмед Бест"},
                {text: "Джоэл Эдгертон"},
            ],
        },
        {
            text: "Что Люк Скайуокер потерял в битве с Дартом Вейдером?",
            answers: [
                {text: "Его левая рука"},
                {text: "Его левая нога"},
                {text: "Его правая рука", correct: true},
                {text: "Его левая нога"},
            ],
        },
        {
            text: "По словам Императора, в чем заключалась слабость Люка Скайуокера?",
            answers: [
                {text: "Его вера в светлую сторону силы"},
                {text: "Его вера в своих друзей", correct: true},
                {text: "Его отсутствие видения"},
                {text: "Его сопротивление Темной стороне Силы"},
            ],
        },
        {
            text: "Где начались Войны клонов?",
            answers: [
                {text: "Татуин"},
                {text: "геоноз", correct: true},
                {text: "Набу"},
                {text: "Корусант"},
            ],
        },
        {
            text: " В каком фильме из «Звездных войн» есть такая цитата: «Я участвовал в этой битве с шести лет!»",
            answers: [
                {text: "Звездные войны: новая надежда"},
                {text: "Звездные войны: Восхождение Скайуокера"},
                {text: "Разбойник One: Star Wars история", correct: true},
                {text: "Соло: история звездных войн"},
            ],
        },
        {
            text: "Чем Джар Джар Бинкс в конечном итоге обязан Куай-Гону Джинну после того, как тот же спас его во время вторжения на Набу??",
            answers: [
                {text: "Поездка в Ото Гунга"},
                {text: "Бонго"},
                {text: "Долг чести", correct: true},
                {text: "9,000 кредитов"},
            ],
        },
        {
            text: "Что Оуэн Ларс рассказал Люку Скайуокеру о своем отце?",
            answers: [
                {text: "Он был рыцарем-джедаем"},
                {text: "Он был лордом ситхов"},
                {text: "Он был штурманом на грузовом судне специй", correct: true},
                {text: "Он был летчиком-истребителем"},
            ],
        },
        {
            text: "Кто сказал эту цитату: «Я выбираю жить для своего народа»?",
            answers: [
                {text: "Падме Амидала"},
                {text: "Риё Чучи", correct: true},
                {text: "Королева Джамилия"},
                {text: "Гера Синдулла"},
            ],
        },
        {
            text: "Какое оружие предпочитает Чубакка?",
            answers: [
                {text: "Бластерная винтовка"},
                {text: "Лазерный меч"},
                {text: "Металлический клуб"},
                {text: "Bowcaster" , correct: true},
            ],
        },
    ]
};


